# 便利なオブジェクト

# ============================================
# 配列(Array)
# ============================================

names =[ '小林','林','高野','盛岡']

# ひとつの要素を出力
puts names[0]
puts names[1]
puts names[3]
# 配列の全要素を出力
puts names

# 配列の中身
# 配列には複数のオブジェクトを混ぜれる

mixed =[1,"歌詞",2,"風",3]
puts mixed[0]
puts mixed[1]
puts mixed

# 配列の大きさ
# array.size

puts names.size

# 配列と繰り返し
# ============================================
# 配列.each do |変数|
# 	繰り返したい処理
# end
# ============================================

names.each do |name|
	puts name
end


# ============================================
#ハッシュ(Hash)
# 文字列やシンボルなどをキーにしてオブジェクトを格納する
# シンボルとは文字列に似たオブジェクトで、Rubyがメソッドなど
# の名前を識別するためのラベルをオブジェクトにしたものです。
# ============================================

# ハッシュを作る
song = { :title => "Paranoid Android", :artist => "Radiohead"}
person = { "名前" => "高橋", "仮名" => "タカハシ"}

puts song[:title]
puts person["名前"]
puts person

# ハッシュの繰り返し
person.each do | key, value|
	puts "#{key}: #{value}"
end

# ============================================
#正規表現
# ============================================
