# ============================================
# 配列の作り方

nums = [1,2,3,4,5]

# Array.newを使う
a = Array.new
p a

a = Array.new(5)
p a

a = Array.new(5, 0)
p a

# ============================================
# %Wや%i

lang = %w(Ruby Perl Scheme Pike REBOL)
p lang

lang = %i(Ruby Perl Scheme Pike REBOL)
p lang

# ============================================
# 文字列のsplitメソッドを使う

column = "2016/02/01, foo.html,proxy.example.jp".split(',')
p column


# ============================================
# インデックスの使い方

# 要素を取り出す

alpha = ["a","b","c","d","e","f"]
alpha[2,3] = ["C","D","E"]
p alpha

# ============================================
# 複数のインデックスから配列を作る
# a.valies_at(n1,n2,…)

alpha = %w(a b c d e f)
p alpha.values_at(1,3,5)

# ============================================


# ============================================
# 「|」と「+」の違い

num = [1,2,3]
even = [2,4,6]

p(num + even)
p(num | even)

# ============================================
# 配列の主なメソッド

# 配列に要素を加える

a = [1,2,3,4,5]
a.unshift(0)
p a

# ============================================
# 配列から要素を取り除く

a = [1,2,3,4,5]
a.delete_if {|i| i > 3}
p a
