# ============================================
# 演算子

# ============================================
# 代入演算子

# ============================================
# 論理演算子の応用

# ①左側の式から順に評価される
# ②論理式の真偽が決定すると、残りの式は評価されない
# ③最後に評価された式の値が論理式全体の値となる。

# ============================================
# 条件演算子

# 条件 ? 式1 : 式2
#    ⇩
# if 条件
# 	式1
# else
# 	式2
# end

a = 1
b = 2
max = (a > b) ? a : b
p max

# ============================================
# 範囲演算子

Range.new(1,10)
# 省略系
# 1..10

sum = 0
for i in 1..5
	sum += i
end
puts sum

# ============================================





